simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main_selftest.cpp
/*
 * main_selftest.cpp — Firmware de AUTOTEST del nodo esclavo.
 *
 * Reemplaza a main.cpp solo en el env `slaveTest` (ver build_src_filter en
 * platformio.ini). Comparte todos los drivers con el firmware de campo:
 * psoc_uart, espnow_transport, local_ui. Si se arregla un driver, el autotest
 * hereda el arreglo.
 *
 * QUE PRUEBA
 * ----------
 * Que ESTA placa este bien armada. No prueba el protocolo ni el sistema (eso
 * ya lo cubren los runners E1..E19 desde la PC): prueba soldaduras, ruteo,
 * componentes y cables, sin tocar el circuito y sin instrumental.
 *
 * REPARTO CON EL PSoC
 * -------------------
 * El PSoC expone primitivas atomicas (poner un IDAC, medir un tap del AMux,
 * contar flancos de SYNC) y contesta una trama 0xC5 por medicion. Este
 * archivo secuencia y decide. La aritmetica vive aca porque aca hay punto
 * flotante comodo y no hay presion de SRAM.
 *
 * COMO SE LEE EL RESULTADO
 * ------------------------
 * Checklist por USB a 115200, mas una linea #JSON para automatizar, mas un
 * resumen en el OLED para usarlo en campo sin PC.
 */

#include <Arduino.h>
#include <WiFi.h>
#include <esp_wifi.h>
#include <esp_system.h>
#include <Preferences.h>

#include "psoc_uart.h"
#include "espnow_compat.h"
#include "espnow_transport.h"
#include "sync_protocol.h"
#include "local_ui.h"
#include "selftest_report.h"

#ifndef NODE_ID
#define NODE_ID 2
#endif
#ifndef SYNC_TO_PSOC_PIN
#define SYNC_TO_PSOC_PIN 27
#endif
#ifndef PSOC_UART_RX
#define PSOC_UART_RX 25
#endif
#ifndef LOCAL_BTN_UP_PIN
#define LOCAL_BTN_UP_PIN 34
#endif
#ifndef LOCAL_BTN_DOWN_PIN
#define LOCAL_BTN_DOWN_PIN 35
#endif
#ifndef LOCAL_BTN_OK_PIN
#define LOCAL_BTN_OK_PIN 36
#endif
#ifndef LOCAL_BTN_BACK_PIN
#define LOCAL_BTN_BACK_PIN 39
#endif
#ifndef MASTER_AP_SSID
#define MASTER_AP_SSID "GeoNetwork"
#endif

/* ── Umbrales ──────────────────────────────────────────────────────────────
 * TODOS los criterios de veredicto viven en este bloque. La regla de diseño
 * es fallar solo ante fallas GRUESAS: la cadena tiene un 680 uF y el
 * compensador esta documentado ~10,7 dB fuera de nominal aun despues de
 * calibrar, asi que un umbral apretado reprobaria placas sanas. Todo lo fino
 * se informa como valor medido con ventana WARN.
 * ------------------------------------------------------------------------- */

/* Riel del ADC. El criterio de saturacion del banco es |V| >= 2,3 V como
 * margen frente a los rieles de +-2,5 V (ver AnalisisCircuito/README.md). */
static const int32_t TH_RAIL_UV = 2300000;

/* Escalon del barrido de IDAC para la matriz D2, en codigos. 20 LSB a
 * 3,75 mV/LSB son 75 mV en la referencia. Chico a proposito: el sumador
 * tiene -27k/6,8k ~ -4 y despues viene PGAout, asi que un escalon grande
 * satura los taps de aguas abajo y comprime justo las pendientes que
 * interesan. Si una medicion satura igual, D2 lo reintenta con la mitad. */
static const int  TH_D2_STEP_CODES   = 20;
static const int  TH_D2_MIN_STEP     = 4;

/* Aislamiento hacia atras: una etapa aguas abajo no deberia mover un tap
 * aguas arriba. Se compara contra la pendiente directa de esa misma etapa. */
static const float TH_D2_ISOLATION_RATIO = 0.10f;   /* 10 % */

/* Propagacion hacia adelante: pendiente minima para considerar que la etapa
 * responde. Por debajo de esto la etapa esta muerta (resistor abierto,
 * soldadura fria, opamp quemado). */
static const int32_t TH_D2_MIN_SLOPE_UV_PER_CODE = 200;   /* 0,2 mV por codigo */

/* Cociente de ganancia de PGAout entre codigo 0 (1x) y codigo 2 (4x).
 * Al ser un COCIENTE cancela toda la incertidumbre de los resistores, asi
 * que aca si se puede apretar. */
static const float TH_GAIN_RATIO_NOM = 4.0f;
static const float TH_GAIN_RATIO_TOL = 0.25f;   /* +-25 % */

/* Coherencia entre las 4 configs del ADC: miden la misma tension, tienen que
 * coincidir. Es una autoconsistencia, tampoco depende de tolerancias. */
static const float TH_ADCCFG_SPREAD_MAX = 0.08f;   /* 8 % */

/* Piso de ruido: solo se reprueba por absurdo. */
static const int32_t TH_NOISE_RMS_DEAD_UV = 2;         /* ADC congelado */
static const int32_t TH_NOISE_RMS_MAX_UV  = 200000;    /* etapa oscilando */
static const int32_t TH_NOISE_MAINS_WARN_UV = 100000;  /* 100 mV de 50 Hz */

/* Flancos que manda el ESP para probar la linea de SYNC. */
static const int TH_SYNC_EDGES = 20;

/* Selectores de asentamiento y de largo de serie (indices de las tablas de
 * psoc_selftest.h del PSoC). */
/* Copia de g_st_settle_ms[] del PSoC (psoc_selftest.h). Si se toca alla, hay
 * que tocarla aca: se usa para calcular plazos de espera realistas. */
static const uint32_t ST_SETTLE_MS[8] = { 5u, 30u, 120u, 500u, 1200u, 1200u, 1200u, 1200u };

static const uint8_t SEL_SETTLE_FAST = 0;   /* 5 ms   */
static const uint8_t SEL_SETTLE_DC   = 3;   /* 500 ms */
static const uint8_t SEL_N_NOISE     = 0;   /* 2604 muestras = 1 s justo; con N = fs
                                             * el bin del Goertzel cae exacto (k = f0) y
                                             * la continua se rechaza sola. */

/* ── Perfil de hardware presente ───────────────────────────────────────────
 * La placa se arma por partes: puede faltar el OLED, los botones, la SD o el
 * geofono, y eso NO es una falla. Sin esta declaracion el autotest no puede
 * distinguir "no esta soldado" de "esta soldado y roto", que es justo lo que
 * hay que saber.
 *
 * Se guarda en NVS, asi que se declara una vez y sobrevive a los reflasheos.
 * Por defecto todo esta en AUTO, que nunca reprueba: informa como WARN y
 * explica las dos lecturas posibles.
 * ------------------------------------------------------------------------- */
#define HW_AUSENTE  0u
#define HW_PRESENTE 1u
#define HW_AUTO     2u

struct HwProfile {
    uint8_t oled;
    uint8_t btn;
    uint8_t geo;
    uint8_t sd;
    uint8_t psoc;
};

static HwProfile g_hw = { HW_AUTO, HW_AUTO, HW_AUTO, HW_AUTO, HW_AUTO };

static const char *hwName(uint8_t v)
{
    switch (v) {
        case HW_AUSENTE:  return "ausente";
        case HW_PRESENTE: return "presente";
        default:          return "auto";
    }
}

/* Traduce "no respondio" al veredicto que corresponde segun lo declarado.
 * Es el corazon de "el test tiene que correr sin nada conectado": una parte
 * que no esta no puede reprobar la placa. */
static StVerdict verdictSinRespuesta(uint8_t decl)
{
    if (decl == HW_AUSENTE)  { return ST_V_SKIP; }   /* ya sabiamos que no esta */
    if (decl == HW_PRESENTE) { return ST_V_FAIL; }   /* dijiste que esta y no contesta */
    return ST_V_WARN;                                /* auto: puede no estar soldado */
}

static const char *sufijoSinRespuesta(uint8_t decl)
{
    if (decl == HW_AUSENTE)  { return "declarado ausente"; }
    if (decl == HW_PRESENTE) { return "declarado PRESENTE: revisar soldadura"; }
    return "en auto: si no lo soldaste es esperable";
}

/* ── Estado ──────────────────────────────────────────────────────────────── */
PsocUART psoc;
EspNowTransport transport;

static uint8_t g_masterMac[6] = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF };

