simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main_selftest.cpp
/* Buzon de tramas 0xC5. Un comando puede contestar mas de una (identity
 * manda 2, la calibracion una por etapa, la medicion de ruido 2). */
#define ST_RX_MAX 12
static PsocSelfTestResult g_stRx[ST_RX_MAX];
static volatile uint8_t   g_stRxN = 0;

/* Ultimos eventos DIAG que le importan al secuenciador. */
static volatile bool     g_evArmed = false;
static volatile bool     g_evCalDone = false;
static volatile uint8_t  g_evCalOk = 0;
static volatile uint8_t  g_sdStatus = 0;
static volatile bool     g_sdStatusSeen = false;
static volatile uint32_t g_diagCount = 0;
static volatile uint16_t g_irqTraps = 0;

/* Captura minima para el test del camino digital: solo cuenta lotes y guarda
 * el primero para revisar la rampa. No hace falta el store paginado del
 * firmware de campo. */
static volatile uint16_t g_batchCount = 0;
static PsocBatch         g_firstBatch;
static volatile bool     g_firstBatchSeen = false;

/* Analisis en streaming de la captura. Los lotes no se guardan (no hay lugar
 * y no hace falta): se acumula lo justo para C5 y D7. */
static volatile uint32_t g_anSamples = 0;
static int64_t           g_anSum = 0;
static int64_t           g_anSumSq = 0;
static int32_t           g_anMin = 0, g_anMax = 0;
static uint32_t          g_anMono = 0;       /* muestras crecientes seguidas */
static int32_t           g_anPrev = 0;
static int32_t           g_anBaseline = 0;   /* media de las primeras muestras */
static bool              g_anBaselineSet = false;
static int32_t           g_anPeakDev = 0;    /* mayor |x - baseline| */
static int32_t           g_anFirstSign = 0;  /* signo de la 1a excursion grande */
static int32_t           g_anTrig = 0;       /* umbral de excursion, en counts */

/* RMS de AC (media ya restada). Se calcula al final, no en el lazo. */
static double anRms()
{
    if (g_anSamples == 0) { return 0.0; }
    double ex2 = (double)g_anSumSq / (double)g_anSamples;
    double ex  = (double)g_anSum   / (double)g_anSamples;
    double var = ex2 - ex * ex;
    return (var > 0.0) ? sqrt(var) : 0.0;
}

static void anReset(int32_t trigger)
{
    g_anSamples = 0; g_anSum = 0; g_anSumSq = 0; g_anMin = 0; g_anMax = 0; g_anMono = 0;
    g_anPrev = 0; g_anBaseline = 0; g_anBaselineSet = false;
    g_anPeakDev = 0; g_anFirstSign = 0; g_anTrig = trigger;
}

/* Datos del PSoC descubiertos en C1, que despues usan los tests analogicos. */
static uint8_t g_psocStages = 0;
static uint8_t g_amuxChannels = 0;
static uint8_t g_hwClass = 0xFF;

static Preferences g_prefs;

static void hwLoad()
{
    /* Read-WRITE a proposito. En modo read-only, sobre un namespace que nunca
     * existio, el comportamiento de Preferences cambia entre versiones de
     * arduino-esp32: algunas devuelven false y otras dejan estados raros. Y el
     * namespace virgen es EXACTAMENTE el primer arranque de una placa nueva,
     * que es el caso que hay que sostener. En read-write se crea si no esta. */
    if (!g_prefs.begin("sthw", false)) { return; }   /* sin NVS: quedan en AUTO */
    g_hw.oled = g_prefs.getUChar("oled", HW_AUTO);
    g_hw.btn  = g_prefs.getUChar("btn",  HW_AUTO);
    g_hw.geo  = g_prefs.getUChar("geo",  HW_AUTO);
    g_hw.sd   = g_prefs.getUChar("sd",   HW_AUTO);
    g_hw.psoc = g_prefs.getUChar("psoc", HW_AUTO);
    g_prefs.end();
}

static void hwSave()
{
    if (!g_prefs.begin("sthw", false)) {
        Serial.println(F("[ST] no se pudo abrir NVS: el perfil no queda guardado"));
        return;
    }
    g_prefs.putUChar("oled", g_hw.oled);
    g_prefs.putUChar("btn",  g_hw.btn);
    g_prefs.putUChar("geo",  g_hw.geo);
    g_prefs.putUChar("sd",   g_hw.sd);
    g_prefs.putUChar("psoc", g_hw.psoc);
    g_prefs.end();
}

static void hwPrint()
{
    Serial.println(F("[ST] Perfil de hardware (0=ausente 1=presente 2=auto):"));
    Serial.printf("[ST]   oled = %u (%s)\n", g_hw.oled, hwName(g_hw.oled));
    Serial.printf("[ST]   btn  = %u (%s)   los 4 pulsadores del ESP\n", g_hw.btn, hwName(g_hw.btn));
    Serial.printf("[ST]   geo  = %u (%s)\n", g_hw.geo, hwName(g_hw.geo));
    Serial.printf("[ST]   sd   = %u (%s)\n", g_hw.sd, hwName(g_hw.sd));
    Serial.printf("[ST]   psoc = %u (%s)\n", g_hw.psoc, hwName(g_hw.psoc));
    Serial.println(F("[ST] Cambiar con: hw <parte> <0|1|2>   (queda guardado en NVS)"));
}

/* Resultado de la medicion electrica del bus I2C, hecha en setup() ANTES de
 * que Wire tome los pines. Ver medirBusI2C(). */
static int  g_busSdaAlta = -1;   /* -1 = no medido */
static int  g_busSclAlta = -1;
static int  g_busSdaN = 0, g_busSclN = 0;
static uint32_t g_busSclFlancos = 0;
static int  g_busSdaPu = 0, g_busSclPu = 0;  /* con pull-up interno */
static int  g_busSdaPd = 0, g_busSclPd = 0;  /* con pull-DOWN interno */

/* Contador de flancos en SCL para el test B0b. Va por interrupcion porque una
 * trama de 4 bytes a la velocidad del bus dura decenas de microsegundos: un
 * muestreo por software no la vería nunca. */
static volatile uint32_t g_sclEdges = 0;

static void IRAM_ATTR onSclEdge()
{
    g_sclEdges++;
}

/* ── Callbacks ───────────────────────────────────────────────────────────── */
static void onSelfTest(const PsocSelfTestResult &r)
{
    if (g_stRxN < ST_RX_MAX) { g_stRx[g_stRxN++] = r; }
}

static void onDiag(const PsocDiagEvent &e)
{
    g_diagCount++;
    switch (e.event) {
        case 0x32: g_evArmed = true; break;                 /* PSOC_EVT_ARMED */
        case 0x11: g_evCalDone = true; g_evCalOk = e.value; break;  /* CAL_DONE */
        case 0x48: g_sdStatus = e.value; g_sdStatusSeen = true; break; /* SD_STATUS */
        case 0x7E: case 0x7F: g_irqTraps++; break;          /* trampas de IRQ */
        default: break;
    }
}

static void onBatch(const PsocBatch &b)
{
    if (!g_firstBatchSeen) { g_firstBatch = b; g_firstBatchSeen = true; }
    g_batchCount++;

    for (uint8_t i = 0; i < b.n_samples; i++) {
        int32_t x = b.samples[i].post_digital;
        if (g_anSamples == 0) { g_anMin = x; g_anMax = x; }
        else {
            if (x < g_anMin) { g_anMin = x; }
            if (x > g_anMax) { g_anMax = x; }
            if (x > g_anPrev) { g_anMono++; }
        }
        g_anPrev = x;
        g_anSum += (int64_t)x;
        g_anSumSq += (int64_t)x * (int64_t)x;
        g_anSamples++;

        /* Las primeras 256 muestras fijan la linea de base. Recien despues se
         * busca la excursion: si se tomara la media de TODA la captura, el
         * propio golpe la correria y el signo de la primera excursion, que es
         * el dato de polaridad, saldria mal. */
        if (!g_anBaselineSet && g_anSamples == 256) {
            g_anBaseline = (int32_t)(g_anSum / (int64_t)g_anSamples);
            g_anBaselineSet = true;
        }
        if (g_anBaselineSet) {
            int32_t dev = x - g_anBaseline;
            int32_t adev = (dev < 0) ? -dev : dev;
            if (adev > g_anPeakDev) { g_anPeakDev = adev; }
            if (g_anFirstSign == 0 && g_anTrig > 0 && adev > g_anTrig) {
                g_anFirstSign = (dev > 0) ? 1 : -1;
            }
        }
    }
}

/* ── Utilidades de espera ────────────────────────────────────────────────── */

