simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main_selftest.cpp
/* Bombea el enlace durante ms. Es la unica forma de esperar: si no se llama
 * a poll() los bytes que sube el PSoC por I2C se acumulan en el ring y se
 * pierden por overrun. */
static void stPump(uint32_t ms)
{
    uint32_t t0 = millis();
    do { psoc.poll(); delay(1); } while ((millis() - t0) < ms);
}

static void stRxClear() { g_stRxN = 0; }

/* Espera hasta n tramas 0xC5 o hasta que venza el timeout. Devuelve cuantas
 * llegaron: el que llama decide si alcanzan. */
static uint8_t stAwait(uint8_t n, uint32_t timeoutMs)
{
    uint32_t t0 = millis();
    while (g_stRxN < n && (millis() - t0) < timeoutMs) {
        psoc.poll();
        delay(1);
    }
    return g_stRxN;
}

/* Busca un resultado por id EXIGIENDO status ST_OK.
 *
 * El PSoC contesta la misma trama con ST_ERR o ST_REJECTED cuando no pudo
 * hacer la medicion. Consumir v0/v1 de esas tramas equivale a creerle un
 * numero que el propio PSoC declaro invalido, y eso convierte una falla en un
 * PASS. Para inspeccionar una trama sin importar el status esta stFindAny(). */
static const PsocSelfTestResult *stFindAny(uint8_t id)
{
    for (uint8_t i = 0; i < g_stRxN; i++) {
        if (g_stRx[i].test_id == id) { return &g_stRx[i]; }
    }
    return nullptr;
}

static const PsocSelfTestResult *stFind(uint8_t id)
{
    const PsocSelfTestResult *r = stFindAny(id);
    return (r != nullptr && r->status == ST_OK) ? r : nullptr;
}

/* Una medicion DC de un tap, con reintento. El reintento acotado de 2
 * intentos es el mismo patron que usan todos los runners del banco: hay una
 * clase de transitorio (F6) que hace que el primer comando despues de un
 * cambio de configuracion se ignore en silencio. */
static bool stMeasDc(uint8_t ch, uint8_t settleSel, int32_t &meanUv, int32_t &ppUv)
{
    for (int attempt = 0; attempt < 2; attempt++) {
        if (attempt > 0) {
            /* Drenar antes de reintentar: la respuesta del intento vencido
             * puede seguir en vuelo y colarse como respuesta del nuevo. Con
             * canales distintos no importa (stFind empareja por test_id), pero
             * D5 mide cuatro veces el MISMO canal, uno por config del ADC, y
             * ahi una medida vieja se atribuiria a la config siguiente. */
            stPump(400);
        }
        stRxClear();
        psoc.stMeasDc(settleSel, ch);
        /* El timeout tiene que cubrir el asentamiento pedido mas las 32
         * conversiones del promedio. */
        /* El plazo se calcula con el asentamiento REAL, no con el indice del
         * selector: con el indice, el selector 3 (500 ms) esperaba 13 s por
         * intento, y D1/D2/D4 hacen decenas de mediciones. Una placa con una
         * etapa muda tardaba minutos en decirlo. */
        if (stAwait(1, ST_SETTLE_MS[settleSel & 0x07u] + 3000u) >= 1) {
            const PsocSelfTestResult *r = stFind((uint8_t)(ST_ID_DC_BASE | ch));
            if (r && r->status == ST_OK) { meanUv = r->v0; ppUv = r->v1; return true; }
        }
    }
    return false;
}

static bool stSetIdac(uint8_t stage, uint8_t code)
{
    for (int attempt = 0; attempt < 2; attempt++) {
        if (attempt > 0) { stPump(300); }
        stRxClear();
        psoc.stSetIdac(stage, code);
        if (stAwait(1, 1500) >= 1) {
            const PsocSelfTestResult *r = stFind((uint8_t)(ST_ID_IDAC_BASE | stage));
            if (r && r->status == ST_OK) { return true; }
        }
    }
    return false;
}

static bool isSaturated(int32_t uv) { return (uv >= TH_RAIL_UV) || (uv <= -TH_RAIL_UV); }

/* Cambia el rango del ADC y CONFIRMA con el ACK del PSoC.
 *
 * Sin confirmar, si los cuatro comandos se ignoraran (clase de transitorio F6,
 * o un PSoC ocupado) D5 mediria cuatro veces la MISMA configuracion, obtendria
 * dispersion cero y daria el PASS mas perfecto posible sin haber probado nada. */
static bool stSetAdcConfig(uint8_t cfg)
{
    for (int intento = 0; intento < 2; intento++) {
        uint8_t c, v;
        while (psoc.takeConfigAck(c, v)) { }   /* descartar acks viejos */
        psoc.setAdcConfig(cfg);
        uint32_t t0 = millis();
        while ((millis() - t0) < 1200) {
            psoc.poll();
            if (psoc.takeConfigAck(c, v)) {
                if (c == PSOC_CMD_ADC_CONFIG && v == cfg) { return true; }
            }
            delay(1);
        }
    }
    return false;
}

/* ==========================================================================
 * GRUPO A — ESP32 solo. No necesita al PSoC, asi que corre siempre y sirve
 * para separar "la placa esta mal" de "el PSoC no contesta".
 * ========================================================================== */
static void groupA()
{
    /* A1 — arranque */
    esp_reset_reason_t rr = esp_reset_reason();
    const char *rrName = "?";
    switch (rr) {
        case ESP_RST_POWERON:  rrName = "POWERON"; break;
        case ESP_RST_SW:       rrName = "SW"; break;
        case ESP_RST_PANIC:    rrName = "PANIC"; break;
        case ESP_RST_INT_WDT:  rrName = "INT_WDT"; break;
        case ESP_RST_TASK_WDT: rrName = "TASK_WDT"; break;
        case ESP_RST_BROWNOUT: rrName = "BROWNOUT"; break;
        case ESP_RST_EXT:      rrName = "EXT"; break;
        default: break;
    }
    /* Un reset por panico o por brownout no es un detalle: el primero es un
     * bug de firmware y el segundo es alimentacion insuficiente, que en una
     * placa recien armada suele ser un regulador mal puesto. */
    bool badReset = (rr == ESP_RST_PANIC || rr == ESP_RST_BROWNOUT ||
                     rr == ESP_RST_INT_WDT || rr == ESP_RST_TASK_WDT);
    stReportItem("A1", "Arranque ESP32", badReset ? ST_V_FAIL : ST_V_PASS,
                 "%s, heap %u KB, flash %u MB",
                 rrName, (unsigned)(ESP.getFreeHeap() / 1024),
                 (unsigned)(ESP.getFlashChipSize() / (1024 * 1024)));

    /* A2 — OLED.
     *
     * IMPORTANTE: el SSD1306 por SPI **no se puede detectar**. El bus es de
     * ida solamente y la libreria devuelve false unicamente si le falla el
     * malloc del framebuffer, asi que localUiReady() da true con el OLED
     * soldado, sin soldar o quemado. Dar PASS con eso seria mentir.
     *
     * Lo unico honesto: decir que se dibujo el patron y que la confirmacion es
     * visual. Si el OLED esta declarado ausente, ni se intenta. */
    if (g_hw.oled == HW_AUSENTE) {
        stReportItem("A2", "OLED SSD1306 por SPI", ST_V_SKIP,
                     "declarado ausente (hw oled 0)");
    } else if (!localUiReady()) {
        /* Esto solo pasa si fallo el framebuffer: es un problema de memoria
         * del ESP, no del OLED. */
        stReportItem("A2", "OLED SSD1306 por SPI", ST_V_FAIL,
                     "fallo el framebuffer del driver: problema de RAM del ESP32");
    } else {
        stReportItem("A2", "OLED SSD1306 por SPI", ST_V_INFO,
                     "patron dibujado. El SPI no tiene lectura: confirmalo con la "
                     "vista y responde 'oled si' u 'oled no'");
    }

    /* A3 — pull-ups de los botones.
     * GPIO34/35/36/39 son SOLO ENTRADA y NO tienen pull-up interno; el driver
     * los configura como INPUT pelado. Si faltan los 10 k externos a 3V3 el
     * pin flota y la UI de campo queda inservible. Se exige nivel alto
     * ESTABLE: un pin flotante puede leer alto por casualidad en una lectura
     * suelta, pero no se mantiene 200 ms. */
    const uint8_t btnPins[4] = { LOCAL_BTN_UP_PIN, LOCAL_BTN_DOWN_PIN,
                                 LOCAL_BTN_OK_PIN, LOCAL_BTN_BACK_PIN };
    const char *btnName[4] = { "UP", "DOWN", "OK", "BACK" };
    char btnBad[64]; btnBad[0] = '\0';
    int nBad = 0;
    for (int i = 0; i < 4; i++) {
        pinMode(btnPins[i], INPUT);
        int lows = 0;
        for (int k = 0; k < 200; k++) { if (digitalRead(btnPins[i]) == LOW) { lows++; } delay(1); }
        if (lows > 0) {
            nBad++;
            char one[20];
            snprintf(one, sizeof(one), "%s%s(%u)", nBad > 1 ? "," : "",
                     btnName[i], (unsigned)btnPins[i]);
            strncat(btnBad, one, sizeof(btnBad) - strlen(btnBad) - 1);
        }
    }
    if (g_hw.btn == HW_AUSENTE) {
        stReportItem("A3", "Pull-ups de botones", ST_V_SKIP,
                     "declarado ausente (hw btn 0)");
    } else if (nBad == 0) {
        /* Ojo: esto NO prueba que los pull-ups esten. Un pin de solo entrada
         * flotante puede sostener alto por carga residual. Prueba que ninguno
         * este pegado en bajo, que es la falla que si se detecta. */
        stReportItem("A3", "Pull-ups de botones", ST_V_PASS,
                     "4/4 en alto estable (no descarta pull-up ausente: ver con tester)");
    } else {
        /* Pegado en bajo si es concluyente: o falta el pull-up de 10 k, o el
         * pulsador esta en corto, o el pin esta puenteado a masa. */
        stReportItem("A3", "Pull-ups de botones",
                     (g_hw.btn == HW_AUTO) ? ST_V_WARN : ST_V_FAIL,
                     "%s en bajo -> falta R 10k a 3V3, pulsador en corto, o sin soldar (%s)",
                     btnBad, sufijoSinRespuesta(g_hw.btn));
    }

