simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main_selftest.cpp
    /* A4 — ESP-NOW */
    uint8_t bc[6] = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF };
    MsgHello hello;
    hello.cmd = CMD_HELLO; hello.node_id = NODE_ID; hello.psoc_ok = 0;
    hello.sample_rate = 0; hello.hw_class = SLAVE_HW_UNKNOWN; hello.sd_present = 0;
    esp_err_t e = espnowSend(bc, (const uint8_t *)&hello, sizeof(hello));
    stReportItem("A4", "ESP-NOW (init + peer + TX)",
                 (e == ESP_OK) ? ST_V_PASS : ST_V_FAIL,
                 "esp_now_send=%d, canal %u", (int)e, (unsigned)WiFi.channel());

    /* A5 — radio. Informativo: que el maestro no este encendido no es una
     * falla de ESTA placa. */
    /* Asincrono con espera acotada: la version sincrona bloquea hasta que la
     * IDF decide terminar, y con una radio en mal estado eso parece un
     * cuelgue. Asi el autotest siempre sigue. */
    WiFi.scanNetworks(true, true);
    uint32_t tscan = millis();
    int n = WIFI_SCAN_RUNNING;
    while ((millis() - tscan) < 6000) {
        n = WiFi.scanComplete();
        if (n >= 0 || n == WIFI_SCAN_FAILED) { break; }
        delay(50);
    }
    if (n < 0) { WiFi.scanDelete(); n = 0; }
    int ch = 0; int32_t best = -1000;
    for (int i = 0; i < n; i++) {
        if (WiFi.SSID(i) == MASTER_AP_SSID && WiFi.RSSI(i) > best) {
            best = WiFi.RSSI(i); ch = WiFi.channel(i);
        }
    }
    WiFi.scanDelete();
    if (ch != 0) {
        stReportItem("A5", "Radio / maestro visible", ST_V_INFO,
                     "%s en canal %d, RSSI %d dBm", MASTER_AP_SSID, ch, (int)best);
    } else {
        stReportItem("A5", "Radio / maestro visible", ST_V_INFO,
                     "%d redes, %s no visible (no es falla de placa)", n, MASTER_AP_SSID);
    }

    /* A6 — GPIO25 */
    stReportItem("A6", "GPIO25 (ex PSOC_UART_RX)", ST_V_SKIP,
                 "sin conectar por diseno: el PSoC nuevo no tiene pin Tx");
}

/* ==========================================================================
 * GRUPO B — enlace ESP <-> PSoC.
 * ========================================================================== */
static bool groupB()
{
    /* B0 y B0b: se midieron en setup(), antes de levantar Wire. Ver
     * medirBusI2C() para el por que del orden. */
    if (g_busSdaAlta < 0) {
        stReportItem("B0", "Lineas del bus I2C en reposo", ST_V_SKIP,
                     "no se midio");
    } else if (g_busSdaAlta && g_busSclAlta) {
        stReportItem("B0", "Lineas del bus I2C en reposo", ST_V_PASS,
                     "SDA(%u) y SCL(%u) en alto: los pull-ups estan",
                     (unsigned)PSOC_I2C_SDA, (unsigned)PSOC_I2C_SCL);
    } else if (!g_busSdaAlta && !g_busSclAlta) {
        stReportItem("B0", "Lineas del bus I2C en reposo", ST_V_FAIL,
                     "SDA(%u) y SCL(%u) las DOS en bajo: faltan los pull-ups a 3V3, "
                     "o el otro extremo no tiene alimentacion",
                     (unsigned)PSOC_I2C_SDA, (unsigned)PSOC_I2C_SCL);
    } else {
        const char *cual = g_busSdaAlta ? "SCL" : "SDA";
        int puDeLaMala  = g_busSdaAlta ? g_busSclPu : g_busSdaPu;
        if (puDeLaMala >= 27) {
            stReportItem("B0", "Lineas del bus I2C en reposo", ST_V_FAIL,
                         "%s en bajo pero SUBE con el pull-up interno: falta el "
                         "pull-up EXTERNO de %s a 3V3 (SDA %d/50, SCL %d/50)",
                         cual, cual, g_busSdaN, g_busSclN);
        } else {
            stReportItem("B0", "Lineas del bus I2C en reposo", ST_V_FAIL,
                         "%s RETENIDA en bajo: no sube ni con el pull-up interno. "
                         "Corto a masa, o un dispositivo trabado sujetando la linea "
                         "(SDA %d/50, SCL %d/50)",
                         cual, g_busSdaN, g_busSclN);
        }
    }

    stReportItem("B0c", "Pull-ups externos, medidos", ST_V_INFO,
                 "SDA flotante %d/50 pu %d/30 pd %d/30 | SCL flotante %d/50 pu %d/30 pd %d/30",
                 g_busSdaN, g_busSdaPu, g_busSdaPd,
                 g_busSclN, g_busSclPu, g_busSclPd);

    /* El pull-down interno es la medicion que decide: con un pull-up externo de
     * 10 k, el divisor contra los 45 k internos deja la linea en 2,7 V (alto).
     * Sin pull-up externo, el pull-down gana. */
    if (g_busSdaPd >= 27 && g_busSclPd < 3) {
        stReportItem("B0d", "Pull-up externo de SCL", ST_V_FAIL,
                     "SDA aguanta el pull-down interno y SCL no: el PIN GPIO%u del ESP "
                     "NO esta viendo un pull-up externo. Si la resistencia esta puesta, "
                     "revisar continuidad DESDE EL PIN (soldadura, pista, o que el otro "
                     "extremo llegue a 3V3)", (unsigned)PSOC_I2C_SCL);
    } else if (g_busSclPd >= 27) {
        stReportItem("B0d", "Pull-up externo de SCL", ST_V_PASS,
                     "SCL aguanta el pull-down interno: el pull-up externo llega al pin");
    }

    if (g_busSclFlancos > 0u) {
        stReportItem("B0b", "Reloj del bus (SCL) al arranque", ST_V_PASS,
                     "%lu flancos en 3 s: el PSoC ESTA transmitiendo",
                     (unsigned long)g_busSclFlancos);
    } else {
        stReportItem("B0b", "Reloj del bus (SCL) al arranque", ST_V_FAIL,
                     "0 flancos en 3 s: el PSoC NO transmite. No es el cableado "
                     "(ver B0): mirar si arranco, si tiene el firmware de autotest, "
                     "y si su I2C esta como maestro");
    }

    /* B1 — subida por I2C. El PSoC es maestro y manda pings solo; si no
     * llega nada, o no hay pull-ups en SDA/SCL, o el PSoC no arranco. */
    /* El PSoC se queda en wait_for_esp() hasta ver un PONG o un STATUS. Si se
     * reinicio despues del ultimo sondeo del ESP (por ejemplo con ToggleReset),
     * nadie se lo vuelve a mandar y queda mudo para siempre. Se lo sondea de
     * nuevo antes de declarar el enlace muerto. */
    for (int k = 0; k < 3; k++) {
        psoc.sendPong();
        psoc.requestStatus();
        stPump(250);
    }

    uint32_t p0 = psoc.pingsRx(), d0 = psoc.diagEventsRx(), b0 = psoc.bytesRx();
    stPump(1500);
    uint32_t dPing = psoc.pingsRx() - p0;
    uint32_t dDiag = psoc.diagEventsRx() - d0;
    uint32_t dBytes = psoc.bytesRx() - b0;
    bool up = (dBytes > 0);
    if (up) {
        stReportItem("B1", "Subida I2C PSoC->ESP (0x42)",
                     (psoc.i2cOverruns() == 0) ? ST_V_PASS : ST_V_WARN,
                     "%lu B/1.5s, %lu pings, %lu diag, overruns=%lu",
                     (unsigned long)dBytes, (unsigned long)dPing,
                     (unsigned long)dDiag, (unsigned long)psoc.i2cOverruns());
    } else {
        /* Silencio total. Las causas posibles, de mas a menos probable:
         * PSoC sin programar o sin alimentar, faltan los pull-ups de SDA/SCL,
         * GND no comun, o SDA/SCL cruzados. El ESP es ESCLAVO I2C: no puede
         * sondear el bus, solo esperar. */
        stReportItem("B1", "Subida I2C PSoC->ESP (0x42)",
                     verdictSinRespuesta(g_hw.psoc),
                     "silencio total en 1.5 s. Revisar, en orden: PSoC programado y "
                     "alimentado / pull-ups de SDA(21) y SCL(22) a 3V3 / GND comun / "
                     "SDA-SCL cruzados. %s", sufijoSinRespuesta(g_hw.psoc));
    }

    if (!up) {
        /* Sin enlace todo lo demas daria FAIL en cascada y taparia la causa
         * real, asi que se marca SKIP con el motivo explicito. El grupo A ya
         * corrio: si A pasa y B no, el problema esta del lado del PSoC o del
         * cableado entre los dos, no en el ESP. */
        stReportItem("B2", "Bajada UART ESP->PSoC", ST_V_SKIP,
                     "sin enlace de subida: no se puede confirmar la ida");
        stReportItem("B3", "Linea SYNC GPIO27 -> P0[4]", ST_V_SKIP,
                     "sin enlace de subida: el PSoC no puede reportar los flancos");
        return false;
    }

    /* B2 — bajada por UART. Se manda STATUS y tienen que volver eventos.
     * Un solo test prueba LOS DOS cables: si el 0xA5 no llegara por GPIO26,
     * no habria respuesta; si la respuesta no volviera por I2C, tampoco. */
    uint32_t d1 = psoc.diagEventsRx();
    uint32_t t0 = millis();
    psoc.requestStatus();
    while ((psoc.diagEventsRx() == d1) && (millis() - t0) < 800) { psoc.poll(); delay(1); }
    uint32_t rtt = millis() - t0;
    bool down = (psoc.diagEventsRx() > d1);
    stReportItem("B2", "Bajada UART ESP->PSoC + vuelta por I2C",
                 down ? ST_V_PASS : ST_V_FAIL,
                 down ? "STATUS respondido en %lu ms"
                      : "sin respuesta en 800 ms: revisar GPIO26 -> Rx P15[0]",
                 (unsigned long)rtt);

    /* B3 — linea de SYNC. Es el unico cable que no se puede probar de otra
     * forma: el PSoC cuenta flancos y el ESP compara con los que genero. */
    stRxClear();
    psoc.stSync(1);
    bool armed = (stAwait(1, 1200) >= 1);
    if (!armed) {
        stReportItem("B3", "Linea SYNC GPIO27 -> P0[4]", ST_V_FAIL,
                     "el PSoC no acepto armar el contador");
    } else {
        pinMode(SYNC_TO_PSOC_PIN, OUTPUT);
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        delay(5);
        for (int i = 0; i < TH_SYNC_EDGES / 2; i++) {
            digitalWrite(SYNC_TO_PSOC_PIN, HIGH); delay(6);
            digitalWrite(SYNC_TO_PSOC_PIN, LOW);  delay(6);
        }
        delay(30);
        stRxClear();
        psoc.stSync(0);
        if (stAwait(1, 1200) >= 1) {
            const PsocSelfTestResult *r = stFind(ST_ID_SYNC);
            int got = r ? (int)r->v0 : -1;
            /* Se generaron TH_SYNC_EDGES/2 ciclos completos. Segun como este
             * configurada la interrupcion del pin, la ISR puede disparar en
             * los dos flancos o en uno solo: las dos cuentas prueban el cable
             * igual de bien. Exigir una sola convertiria una configuracion
             * legitima en un FAIL. */
            bool both = (got == TH_SYNC_EDGES);
            bool one  = (got == TH_SYNC_EDGES / 2);
            /* Dos llamadas separadas y no un formato condicional: los dos
             * formatos toman argumentos distintos y mezclarlos corre los
             * varargs. */
            if (both || one) {
                stReportItem("B3", "Linea SYNC GPIO27 -> P0[4]", ST_V_PASS,
                             "%d flancos en %d ciclos (%s)",
                             got, TH_SYNC_EDGES / 2,
                             both ? "ambos flancos" : "un flanco");
            } else {
                stReportItem("B3", "Linea SYNC GPIO27 -> P0[4]", ST_V_FAIL,
                             "%d flancos en %d ciclos: se esperaban %d o %d",
                             got, TH_SYNC_EDGES / 2, TH_SYNC_EDGES, TH_SYNC_EDGES / 2);
            }
        } else {
            stReportItem("B3", "Linea SYNC GPIO27 -> P0[4]", ST_V_FAIL,
                         "el PSoC no contesto la lectura del contador");
        }
    }
    return true;
}

/* Dispara una captura de n lotes y espera a que lleguen. Es el mismo camino
 * que usa el firmware de campo (SETN -> PRESTART -> flanco de SYNC); la unica
 * diferencia es que aca los lotes se analizan al vuelo en vez de guardarse.
 * La usan C4 (rampa cruda), C5 (rampa por el FIR) y D7 (golpe al geofono). */
static bool stCapture(uint16_t n, int32_t trigger)
{
    /* Drenar lo que quedo de la captura anterior ANTES de poner el analizador
     * a cero: C4 y C5 corren pegadas y D7 hace dos capturas seguidas, asi que
     * un volcado que todavia esta llegando meteria sus muestras en el
     * acumulador de la nueva y el veredicto saldria de datos mezclados. */
    stPump(300);

    g_batchCount = 0;
    g_firstBatchSeen = false;
    anReset(trigger);

