simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main_selftest.cpp
    psoc.setN(n);
    stPump(150);
    g_evArmed = false;
    psoc.preStart();
    uint32_t t0 = millis();
    while (!g_evArmed && (millis() - t0) < 2000) { psoc.poll(); delay(1); }
    if (!g_evArmed) { return false; }

    pinMode(SYNC_TO_PSOC_PIN, OUTPUT);
    digitalWrite(SYNC_TO_PSOC_PIN, HIGH);
    /* Duracion nominal de la captura mas margen para el volcado: n lotes de
     * 30 muestras a 2604 Hz, y el volcado sale de a un lote por vuelta del
     * lazo principal del PSoC. */
    uint32_t nominal = ((uint32_t)n * 30UL * 1000UL) / 2604UL;
    uint32_t plazo = nominal + 2000UL + (uint32_t)n * 4UL;
    uint32_t t1 = millis();
    while ((g_batchCount < n) && ((millis() - t1) < plazo)) {
        psoc.poll();
        delay(1);
    }
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    stPump(400);

    /* Llegar a ARMED no es haber capturado. Antes se devolvia true por el solo
     * hecho de armarse, asi que una captura que no entrego un solo lote se
     * analizaba igual: C5 la convertia en SKIP y D7 media un fondo inexistente. */
    return (g_batchCount > 0u);
}

/* ==========================================================================
 * GRUPO C — infraestructura del PSoC.
 * ========================================================================== */
static bool groupC()
{
    /* C1 — identidad */
    stRxClear();
    psoc.stReport(ST_REP_IDENTITY);
    stAwait(2, 2000);
    const PsocSelfTestResult *id = stFind(ST_ID_IDENTITY);
    const PsocSelfTestResult *sg = stFind(ST_ID_STAGES);
    /* Validar ANTES de castear: v0/v1 son int32 que vienen del PSoC, que es
     * justamente el que puede estar roto. Un valor absurdo envolvia al pasar a
     * uint8 y despues se usaba como cantidad de etapas y de canales. */
    bool idOk = (id != nullptr) && (sg != nullptr) &&
                (id->v0 == 0 || id->v0 == 1) &&
                (sg->v0 >= 1 && sg->v0 <= 4) &&
                (sg->v1 >= 1 && sg->v1 <= 16) &&
                (sg->v1 >= sg->v0);
    if (idOk) {
        g_hwClass = (uint8_t)id->v0;
        g_psocStages = (uint8_t)sg->v0;
        g_amuxChannels = (uint8_t)sg->v1;
        stReportItem("C1", "Identidad del PSoC", ST_V_PASS,
                     "clase=%s, Fs=%ld Hz, %u etapas, %u canales AMux",
                     (g_hwClass == 0) ? "GEO" : "HAMMER", (long)id->v1,
                     (unsigned)g_psocStages, (unsigned)g_amuxChannels);
    } else if (id != nullptr && sg != nullptr) {
        stReportItem("C1", "Identidad del PSoC", ST_V_FAIL,
                     "valores fuera de rango: clase=%ld etapas=%ld canales=%ld",
                     (long)id->v0, (long)sg->v0, (long)sg->v1);
        return false;
    } else {
        /* El enlace esta vivo (B1 y B2 pasaron) pero el PSoC no contesta el
         * reporte de identidad. La causa abrumadoramente mas probable no es
         * una falla de placa: es que el PSoC tiene grabado el firmware de
         * CAMPO, que no conoce los comandos 0xA0..0xA7 y los descarta en
         * silencio. Seguir con C y D daria diez FAIL por timeout, varios
         * minutos de espera y un diagnostico equivocado. */
        stReportItem("C1", "Identidad del PSoC", ST_V_FAIL,
                     "el enlace anda pero no contesta 0xA0: el PSoC casi seguro "
                     "tiene el firmware de CAMPO, no el de autotest");
        return false;
    }

    /* C2 — trampas de IRQ. Cualquier IRQ inesperada o HardFault es una
     * bandera roja: el firmware de campo las reporta pero nadie las mira. */
    stRxClear();
    psoc.stReport(ST_REP_IRQ);
    stAwait(1, 1500);
    const PsocSelfTestResult *tr = stFind(ST_ID_IRQTRAP);
    if (tr) {
        bool clean = (tr->v0 == 0 && tr->v1 == 0 && g_irqTraps == 0);
        stReportItem("C2", "Sin trampas de IRQ / HardFault",
                     clean ? ST_V_PASS : ST_V_FAIL,
                     "IRQ inesperadas=%ld, hardfaults=%ld, vistas por el ESP=%u",
                     (long)tr->v0, (long)tr->v1, (unsigned)g_irqTraps);
    } else {
        stReportItem("C2", "Sin trampas de IRQ / HardFault", ST_V_FAIL, "sin respuesta");
    }

    /* C3 — EEPROM. Solo lectura. Cero slots validos es lo NORMAL en una placa
     * recien armada, asi que es WARN y no FAIL. */
    stRxClear();
    psoc.stReport(ST_REP_EEPROM);
    stAwait(1, 3000);
    const PsocSelfTestResult *ee = stFind(ST_ID_EEPROM);
    if (ee) {
        stReportItem("C3", "EEPROM de calibracion (CRC-16)",
                     (ee->v0 > 0) ? ST_V_PASS : ST_V_WARN,
                     (ee->v0 > 0) ? "%ld/9 slots con CRC valido, mascara 0x%03lX"
                                  : "0/9 slots: placa sin calibrar todavia (esperable)",
                     (long)ee->v0, (long)ee->v1);
    } else {
        stReportItem("C3", "EEPROM de calibracion (CRC-16)", ST_V_FAIL, "sin respuesta");
    }

    /* C4 — camino digital de punta a punta con la rampa de debug.
     * No pasa por el analogico: si esto anda y lo analogico no, el problema
     * esta acotado al front end. Si esto NO anda, no tiene sentido creerle a
     * ninguna medicion posterior. */
    psoc.debugRamp(true);
    stPump(150);
    psoc.selectStream(0);          /* camino crudo */
    stPump(150);
    if (!stCapture(8, 0)) {
        stReportItem("C4", "Camino digital E2E (rampa cruda)", ST_V_FAIL,
                     "el PSoC no llego a ARMED");
    } else {
        /* La rampa es monotona creciente salvo en el wrap, que ocurre una vez
         * por vuelta del contador. Se tolera un 5 % de no-crecientes. */
        uint32_t n = g_anSamples;
        bool ramp = (n > 60) && (g_anMono * 100UL >= (n - 1) * 95UL);
        stReportItem("C4", "Camino digital E2E (rampa cruda)",
                     (g_batchCount >= 8 && ramp) ? ST_V_PASS : ST_V_FAIL,
                     "%u/8 lotes, %lu muestras, %lu%% crecientes, bBad=%lu",
                     (unsigned)g_batchCount, (unsigned long)n,
                     n > 1 ? (unsigned long)(g_anMono * 100UL / (n - 1)) : 0UL,
                     (unsigned long)psoc.batchesBad());
    }

