simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main_selftest.cpp
    psoc.debugRamp(false);
    stPump(150);

    /* C5 — filtro FIR de hardware (DFB).
     *
     * NO se puede probar con la rampa de debug: en superMaquina la rampa es
     * una FUENTE distinta (CE_CFG_SRC_DEBUG) de la del filtro
     * (CE_CFG_SRC_FILTER), asi que pedir rampa y stream FIR a la vez no hace
     * pasar la rampa por el DFB. Un test armado asi daria un veredicto que no
     * significa nada.
     *
     * Se prueba contra lo que el FIR tiene que hacer de verdad: es un pasa
     * bajos, asi que sobre el ruido de banda ancha de la entrada real el RMS
     * de la salida filtrada tiene que ser CLARAMENTE menor que el del camino
     * crudo. Si el DFB no arranca, o su DMA no entrega, o los coeficientes no
     * se cargaron, esa reduccion no aparece.
     *
     * 32 lotes (960 muestras) para que las 63 muestras de asentamiento del FIR
     * pesen poco, y RMS en vez de pico-pico porque un solo transitorio de
     * asentamiento domina el pico-pico. */
    double rmsRaw = 0.0, rmsFir = 0.0;
    bool capOk = true;

    psoc.selectStream(0);
    stPump(200);
    if (stCapture(32, 0)) { rmsRaw = anRms(); } else { capOk = false; }

    psoc.selectStream(1);
    stPump(200);
    if (stCapture(32, 0)) { rmsFir = anRms(); } else { capOk = false; }

    psoc.selectStream(0);
    stPump(150);

    if (!capOk) {
        stReportItem("C5", "Filtro FIR de hardware (DFB)", ST_V_FAIL,
                     "no se pudo capturar por alguno de los dos caminos");
    } else if (rmsRaw < 3.0) {
        /* Entrada demasiado quieta: sin ruido que filtrar la comparacion no
         * distingue un FIR sano de uno muerto. */
        stReportItem("C5", "Filtro FIR de hardware (DFB)", ST_V_SKIP,
                     "RMS crudo %.1f counts: muy poco ruido para evaluar el filtro",
                     rmsRaw);
    } else {
        double ratio = rmsFir / rmsRaw;
        /* Un pasa bajos sobre ruido de banda ancha tiene que bajar el RMS de
         * forma evidente. Se pide al menos un 20 % de reduccion, que es un
         * piso muy laxo a proposito: el objetivo es detectar un DFB que no
         * filtra nada (ratio ~1) o que no entrega (ratio ~0). */
        bool dead  = (rmsFir < 0.5);
        bool nofil = (ratio > 0.80);
        /* Tres llamadas y no un formato condicional: los formatos toman
         * distinta cantidad de argumentos y mezclarlos corre los varargs.
         * Ya paso una vez en B3. */
        if (dead) {
            stReportItem("C5", "Filtro FIR de hardware (DFB)", ST_V_FAIL,
                         "salida filtrada muerta: RMS %.1f contra crudo %.1f",
                         rmsFir, rmsRaw);
        } else if (nofil) {
            stReportItem("C5", "Filtro FIR de hardware (DFB)", ST_V_FAIL,
                         "no atenua: RMS FIR/crudo = %.2f (%.1f vs %.1f)",
                         ratio, rmsFir, rmsRaw);
        } else {
            stReportItem("C5", "Filtro FIR de hardware (DFB)", ST_V_PASS,
                         "RMS FIR/crudo = %.2f (%.1f vs %.1f)",
                         ratio, rmsFir, rmsRaw);
        }
    }

    /* C6 — SD. Es el item que quedo explicitamente sin validar en la placa
     * nueva: los cuatro pines de SPIp quedaron repartidos en cuatro puertos
     * distintos y el CS pasa a manejarse por software. */
    g_sdStatusSeen = false;
    psoc.sdStatus(1);
    stPump(2500);
    psoc.sdTest();
    stPump(4000);
    stRxClear();
    psoc.stReport(ST_REP_SD);
    stAwait(1, 2000);
    const PsocSelfTestResult *sd = stFind(ST_ID_SD);
    if (!sd) {
        stReportItem("C6", "SD FatFs (ruteo SPIp nuevo)", ST_V_FAIL,
                     "el PSoC no contesto el reporte de SD");
    } else {
        uint8_t s = (uint8_t)sd->v0;
        bool present  = (s & 0x01) != 0;
        bool selftest = (s & 0x08) != 0;
        bool fat      = (s & 0x10) != 0;

        if (!present) {
            /* Sin tarjeta no se puede saber si el ruteo de SPIp esta bien.
             * Con la SD declarada presente eso si es una falla. */
            stReportItem("C6", "SD FatFs (ruteo SPIp nuevo)",
                         verdictSinRespuesta(g_hw.sd),
                         "el PSoC no ve tarjeta (estado=0x%02X): %s",
                         (unsigned)s, sufijoSinRespuesta(g_hw.sd));
        } else if (!fat) {
            stReportItem("C6", "SD FatFs (ruteo SPIp nuevo)", ST_V_FAIL,
                         "tarjeta detectada pero FAT sin montar (0x%02X): "
                         "formatear en FAT32, o MISO/MOSI cruzados", (unsigned)s);
        } else if (!selftest) {
            stReportItem("C6", "SD FatFs (ruteo SPIp nuevo)", ST_V_FAIL,
                         "FAT montado pero el self-test de escritura fallo (0x%02X, err=0x%02lX): "
                         "sospechar CS (P1[6]) o SCK (P15[5])", (unsigned)s, (long)sd->v1);
        } else {
            stReportItem("C6", "SD FatFs (ruteo SPIp nuevo)", ST_V_PASS,
                         "0x%02X tipo=%u FAT montado, escritura y lectura OK",
                         (unsigned)s, (unsigned)((s >> 1) & 0x03));
        }
    }

    /* C7 — pulsador del PSoC (P2[2]). En reposo tiene que leer un nivel
     * estable. Se muestrea varias veces porque un pulsador rebotando o un pin
     * flotante no sostienen el nivel. La pulsacion en si es interactiva:
     * comando USB `boton`. */
    {
        int lvl = -1; bool stable = true; int leidas = 0;
        for (int k = 0; k < 5; k++) {
            stRxClear();
            psoc.stReport(ST_REP_BUTTON);
            if (stAwait(1, 1200) >= 1) {
                const PsocSelfTestResult *r = stFind(ST_ID_BUTTON);
                if (r != nullptr && (r->v0 == 0 || r->v0 == 1)) {
                    leidas++;
                    if (lvl < 0) { lvl = (int)r->v0; }
                    else if ((int)r->v0 != lvl) { stable = false; }
                }
            }
            delay(40);
        }
        /* Se exigen las CINCO lecturas: antes bastaba una para declarar
         * "estable en 5 lecturas", que es directamente falso. */
        if (leidas < 5) {
            stReportItem("C7", "Pulsador del PSoC en reposo", ST_V_FAIL,
                         "solo %d de 5 lecturas validas", leidas);
        } else {
            stReportItem("C7", "Pulsador del PSoC en reposo",
                         stable ? ST_V_PASS : ST_V_FAIL,
                         stable ? "nivel %d estable en 5 lecturas"
                                : "nivel inestable: pulsador rebotando o pin flotante",
                         lvl);
        }
    }

