simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main_selftest.cpp
    return true;
}

/* ==========================================================================
 * GRUPO D — analogico. El nucleo del autotest.
 * ========================================================================== */

/* Pendientes medidas en D2, en uV por codigo de IDAC. Filas = etapa que se
 * mueve, columnas = tap donde se mide. */
static float g_slope[4][4];
static bool  g_slopeOk[4][4];
/* Un extremo del barrido contra el riel comprime la pendiente. Se marca aparte
 * porque D4 (cociente de ganancia) tiene que negarse a dar un veredicto en vez
 * de informar un cociente que en realidad es basura. */
static bool  g_slopeSat[4][4];

/* Barre una etapa y mide todos los taps. Devuelve false si no se pudo. */
static bool d2SweepStage(uint8_t stage, uint8_t nTaps, int stepCodes)
{
    uint8_t base;
    /* Punto de partida: el codigo que tiene puesto ahora. Se centra el
     * escalon alrededor de el para no alejarse del punto de trabajo. */
    stRxClear();
    psoc.stReport(ST_REP_CAL);
    stAwait(nTaps, 2500);
    const PsocSelfTestResult *cur = stFind((uint8_t)(ST_ID_CAL_BASE | stage));
    base = cur ? (uint8_t)cur->v0 : 128;

    int lo = (int)base - stepCodes;
    int hi = (int)base + stepCodes;
    if (lo < 0)   { hi -= lo; lo = 0; }
    if (hi > 255) { lo -= (hi - 255); hi = 255; }
    if (lo < 0) { lo = 0; }
    int span = hi - lo;
    if (span < TH_D2_MIN_STEP) { return false; }

    int32_t vlo[4], vhi[4], pp;
    bool okLo[4], okHi[4];

    if (!stSetIdac(stage, (uint8_t)lo)) { (void)stSetIdac(stage, base); return false; }
    for (uint8_t ch = 0; ch < nTaps; ch++) {
        okLo[ch] = stMeasDc(ch, SEL_SETTLE_DC, vlo[ch], pp);
        if (!okLo[ch]) { vlo[ch] = 0; }
    }
    if (!stSetIdac(stage, (uint8_t)hi)) { (void)stSetIdac(stage, base); return false; }
    for (uint8_t ch = 0; ch < nTaps; ch++) {
        okHi[ch] = stMeasDc(ch, SEL_SETTLE_DC, vhi[ch], pp);
        if (!okHi[ch]) { vhi[ch] = 0; }
    }
    (void)stSetIdac(stage, base);   /* siempre restaurar */

    /* Si algun tap saturo en cualquiera de los dos extremos, la pendiente
     * queda comprimida y no sirve. Se reintenta con la mitad del escalon. */
    for (uint8_t ch = 0; ch < nTaps; ch++) {
        if (!okLo[ch] || !okHi[ch]) { continue; }
        if (isSaturated(vlo[ch]) || isSaturated(vhi[ch])) {
            if (stepCodes / 2 >= TH_D2_MIN_STEP) {
                return d2SweepStage(stage, nTaps, stepCodes / 2);
            }
        }
    }

    for (uint8_t ch = 0; ch < nTaps; ch++) {
        /* La pendiente solo vale si midieron LOS DOS extremos. Antes se ponia
         * el extremo fallido en cero y despues se sobrescribia g_slopeOk=true:
         * un solo extremo perdido producia una pendiente enorme e inventada,
         * que hacia pasar una etapa muerta. */
        if (!okLo[ch] || !okHi[ch]) {
            g_slopeOk[stage][ch] = false;
            g_slope[stage][ch] = 0.0f;
            continue;
        }
        g_slope[stage][ch] = (float)(vhi[ch] - vlo[ch]) / (float)span;
        g_slopeOk[stage][ch] = true;
        g_slopeSat[stage][ch] = isSaturated(vlo[ch]) || isSaturated(vhi[ch]);
    }
    return true;
}

static void groupD()
{
    uint8_t nTaps = (g_psocStages > 0 && g_psocStages <= 4) ? g_psocStages : 4;

    /* D1 — reposo de las referencias. */
    {
        char det[96]; det[0] = '\0';
        bool railed = false;
        uint8_t medidos = 0;
        for (uint8_t ch = 0; ch < nTaps; ch++) {
            int32_t m, pp;
            if (stMeasDc(ch, SEL_SETTLE_DC, m, pp)) {
                medidos++;
                char one[24];
                snprintf(one, sizeof(one), "%sch%u=%ldmV", ch ? " " : "",
                         (unsigned)ch, (long)(m / 1000));
                strncat(det, one, sizeof(det) - strlen(det) - 1);
                if (isSaturated(m)) { railed = true; }
            }
        }
        /* Sin mediciones no hay veredicto. Antes, cero respuestas dejaban
         * railed=false y el item daba PASS: el aspecto de una placa perfecta
         * sobre una que no contesta una sola medida. */
        if (medidos < nTaps) {
            stReportItem("D1", "Reposo de los taps analogicos", ST_V_FAIL,
                         "solo %u de %u taps respondieron. %s",
                         (unsigned)medidos, (unsigned)nTaps, det);
        } else {
            stReportItem("D1", "Reposo de los taps analogicos",
                         railed ? ST_V_FAIL : ST_V_PASS,
                         railed ? "%s  <- algun tap contra el riel" : "%s", det);
        }

        /* El canal del capacitor tiene criterio propio: es un 100 nF a Vss,
         * o sea que legitimamente lee cerca de un riel. Reprobarlo por
         * "riel" marcaria en falta una placa sana. */
        if (g_amuxChannels > nTaps) {
            int32_t m, pp;
            if (stMeasDc((uint8_t)(g_amuxChannels - 1), SEL_SETTLE_DC, m, pp)) {
                stReportItem("D1b", "AMuxCapacitor (100 nF a Vss)", ST_V_INFO,
                             "%ld mV (cerca de Vss es lo esperado)", (long)(m / 1000));
            }
        }
    }

    /* D2 — matriz de transferencia DC.
     * El veredicto NO se juzga contra valores nominales sino contra la
     * ESTRUCTURA TRIANGULAR SUPERIOR, que es un invariante insensible a
     * tolerancias: una etapa mueve los taps de aguas abajo y no los de aguas
     * arriba. Eso localiza la falla en una etapa concreta sin pedirle
     * precision a nada. */
    for (int i = 0; i < 4; i++) {
        for (int j = 0; j < 4; j++) {
            g_slope[i][j] = 0.0f; g_slopeOk[i][j] = false; g_slopeSat[i][j] = false;
        }
    }
    int sweeps = 0;
    for (uint8_t k = 0; k < nTaps; k++) {
        Serial.printf("    D2: barriendo etapa %u de %u...\n",
                      (unsigned)(k + 1u), (unsigned)nTaps);
        if (d2SweepStage(k, nTaps, TH_D2_STEP_CODES)) { sweeps++; }
    }

    {
        int badFwd = 0, badIso = 0;
        char worst[64]; worst[0] = '\0';
        for (uint8_t k = 0; k < nTaps; k++) {
            float diag = fabsf(g_slope[k][k]);
            /* Propagacion hacia adelante: la etapa tiene que mover su propio
             * tap. Si no lo mueve, esa etapa esta muerta. */
            if (!g_slopeOk[k][k] || diag < (float)TH_D2_MIN_SLOPE_UV_PER_CODE) {
                badFwd++;
                if (worst[0] == '\0') {
                    snprintf(worst, sizeof(worst), "etapa %u no mueve su tap (%.0f uV/cod)",
                             (unsigned)k, (double)diag);
                }
            }
            /* Aislamiento hacia atras. */
            for (uint8_t m = 0; m < k; m++) {
                if (g_slopeOk[k][m] && diag > 0.0f &&
                    fabsf(g_slope[k][m]) > TH_D2_ISOLATION_RATIO * diag) {
                    badIso++;
                    if (worst[0] == '\0') {
                        snprintf(worst, sizeof(worst),
                                 "etapa %u mueve el tap %u (aguas arriba)",
                                 (unsigned)k, (unsigned)m);
                    }
                }
            }
        }
        StVerdict v = (sweeps == 0) ? ST_V_FAIL
                    : (badFwd > 0) ? ST_V_FAIL
                    : (badIso > 0) ? ST_V_WARN : ST_V_PASS;
        if (worst[0] != '\0') {
            stReportItem("D2", "Matriz DC IDAC->etapa", v,
                         "%d/%u barridos, %d etapa(s) sin respuesta, %d fuga(s): %s",
                         sweeps, (unsigned)nTaps, badFwd, badIso, worst);
        } else {
            stReportItem("D2", "Matriz DC IDAC->etapa", v,
                         "%d/%u barridos, triangular superior OK, aislamiento < %.0f%%",
                         sweeps, (unsigned)nTaps,
                         (double)(TH_D2_ISOLATION_RATIO * 100.0f));
        }

        /* Las pendientes crudas se imprimen siempre: son el dato que sirve
         * para diagnosticar, mas alla del veredicto. */
        for (uint8_t k = 0; k < nTaps; k++) {
            char row[96]; row[0] = '\0';
            for (uint8_t m = 0; m < nTaps; m++) {
                char one[24];
                snprintf(one, sizeof(one), "%s%.1f", m ? " " : "",
                         g_slopeOk[k][m] ? (double)g_slope[k][m] : 0.0);
                strncat(row, one, sizeof(row) - strlen(row) - 1);
            }
            char code[8]; snprintf(code, sizeof(code), "D2.%u", (unsigned)k);
            stReportItem(code, "  pendientes uV/codigo", ST_V_INFO, "%s", row);
        }
    }

    /* D3 — asentamiento. Se mide el mismo tap con 5 ms y con 500 ms de
     * espera: la diferencia dice cuanto seguia moviendose. Un capacitor mal
     * puesto cambia esa diferencia. Es WARN, nunca FAIL: la cadena tiene un
     * 680 uF y los tiempos largos son legitimos. */
    {
        int32_t fast, slow, pp;
        uint8_t ch = (uint8_t)(nTaps - 1);
        if (stMeasDc(ch, SEL_SETTLE_FAST, fast, pp) &&
            stMeasDc(ch, SEL_SETTLE_DC, slow, pp)) {
            long drift = (long)labs((long)(slow - fast));
            stReportItem("D3", "Asentamiento del ultimo tap",
                         (drift > 50000) ? ST_V_WARN : ST_V_PASS,
                         "deriva 5ms->500ms = %ld uV", drift);
        } else {
            stReportItem("D3", "Asentamiento del ultimo tap", ST_V_SKIP, "sin medicion");
        }
    }

    /* D4 — cociente de ganancia de PGAout. Al ser un COCIENTE cancela toda
     * la incertidumbre de los resistores del sumador y del pasabajos, asi
     * que es el test analogico mas confiable de todos. */
    if (g_hwClass == 0 && nTaps >= 4) {
        float s1 = 0.0f, s4 = 0.0f;
        bool sat = false;
        psoc.setPgaout(0); stPump(400);
        if (d2SweepStage(2, nTaps, TH_D2_STEP_CODES)) {
            s1 = fabsf(g_slope[2][3]); sat |= g_slopeSat[2][3];
        }
        psoc.setPgaout(2); stPump(400);
        if (d2SweepStage(2, nTaps, TH_D2_STEP_CODES)) {
            s4 = fabsf(g_slope[2][3]); sat |= g_slopeSat[2][3];
        }
        psoc.setPgaout(0); stPump(400);
        if (sat) {
            /* A 4x el punto de trabajo se puede ir contra el riel en una placa
             * sin calibrar. Eso no prueba que la ganancia este mal, asi que no
             * corresponde un FAIL: se informa y se rehace despues de D8. */
            stReportItem("D4", "Ganancia PGAout 1x vs 4x", ST_V_SKIP,
                         "algun extremo saturo: cociente no medible sin calibrar");
        } else if (s1 > 1.0f) {
            float ratio = s4 / s1;
            bool ok = fabsf(ratio - TH_GAIN_RATIO_NOM) <=
                      TH_GAIN_RATIO_NOM * TH_GAIN_RATIO_TOL;
            stReportItem("D4", "Ganancia PGAout 1x vs 4x",
                         ok ? ST_V_PASS : ST_V_FAIL,
                         "cociente %.2f (nominal %.2f, tol %.0f%%)",
                         (double)ratio, (double)TH_GAIN_RATIO_NOM,
                         (double)(TH_GAIN_RATIO_TOL * 100.0f));
        } else {
            stReportItem("D4", "Ganancia PGAout 1x vs 4x", ST_V_FAIL,
                         "sin pendiente medible a ganancia 1x");
        }
    } else {
        stReportItem("D4", "Ganancia PGAout 1x vs 4x", ST_V_SKIP,
                     "solo aplica a nodos GEO");
    }

    /* D6 — piso de ruido. Solo reprueba por absurdo; el valor de 50 Hz se
     * informa siempre porque es el indicador de captacion de red. */
    for (uint8_t ch = 0; ch < nTaps; ch++) {
        stRxClear();
        psoc.stMeasAc(SEL_N_NOISE, ch);
        if (stAwait(2, 12000) >= 2) {
            const PsocSelfTestResult *a = stFind((uint8_t)(ST_ID_ACA_BASE | ch));
            const PsocSelfTestResult *b = stFind((uint8_t)(ST_ID_ACB_BASE | ch));
            if (a && b && a->status == ST_OK && b->status == ST_OK) {
                int32_t rms = a->v1, mains = b->v1;
                StVerdict v = (rms < TH_NOISE_RMS_DEAD_UV) ? ST_V_FAIL
                            : (rms > TH_NOISE_RMS_MAX_UV) ? ST_V_FAIL
                            : (mains > TH_NOISE_MAINS_WARN_UV) ? ST_V_WARN : ST_V_PASS;
                char code[8]; snprintf(code, sizeof(code), "D6.%u", (unsigned)ch);
                stReportItem(code, "Piso de ruido del tap", v,
                             "media %ld uV, RMS %ld uV, pp %ld uV, 50Hz %ld uV",
                             (long)a->v0, (long)rms, (long)b->v0, (long)mains);
                continue;
            }
        }
        char code[8]; snprintf(code, sizeof(code), "D6.%u", (unsigned)ch);
        stReportItem(code, "Piso de ruido del tap", ST_V_FAIL, "sin medicion");
    }

