simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main_selftest.cpp
    /* D6b — indicador de geofono conectado.
     *
     * El geofono no se puede detectar con un test digital, pero SI se puede
     * medir su efecto: la bobina son unos 375 ohm en paralelo con la red de
     * polarizacion de 50 k, asi que cargar la entrada baja de forma marcada el
     * ruido del primer tap. Con la entrada abierta ese mismo tap levanta mucho
     * mas ruido y mas captacion de red.
     *
     * No se inventa un umbral: se entrega el numero. Corriendo el autotest una
     * vez con el geofono y otra sin el, la diferencia queda a la vista, y ese
     * si es un discriminador confiable para ESTA placa. */
    {
        stRxClear();
        psoc.stMeasAc(SEL_N_NOISE, 0u);
        if (stAwait(2, 12000) >= 2) {
            const PsocSelfTestResult *ga = stFind((uint8_t)(ST_ID_ACA_BASE | 0u));
            const PsocSelfTestResult *gb = stFind((uint8_t)(ST_ID_ACB_BASE | 0u));
            if (ga != nullptr && gb != nullptr) {
                stReportItem("D6b", "Carga de la entrada (indicador de geofono)", ST_V_INFO,
                             "ch0: RMS %ld uV, 50 Hz %ld uV. Con geofono baja; con la "
                             "entrada abierta sube. Comparar las dos corridas",
                             (long)ga->v1, (long)gb->v1);
            } else {
                stReportItem("D6b", "Carga de la entrada (indicador de geofono)", ST_V_SKIP,
                             "el PSoC no devolvio las dos tramas");
            }
        } else {
            stReportItem("D6b", "Carga de la entrada (indicador de geofono)", ST_V_SKIP,
                         "sin medicion");
        }
    }

    /* D8 — auto-calibracion. Corre ACA, despues de D1..D6 (que necesitan la
     * placa sin calibrar) y antes de D5 (que la necesita calibrada). */
    g_evCalDone = false; g_evCalOk = 0;
    Serial.println(F("    D8: calibrando (puede tardar ~20 s, tope 180 s)..."));
    uint32_t tcal = millis();
    psoc.calibrate();
    while (!g_evCalDone && (millis() - tcal) < 180000UL) { psoc.poll(); delay(2); }
    uint32_t calMs = millis() - tcal;
    bool calOk = false;
    if (!g_evCalDone) {
        stReportItem("D8", "Auto-calibracion", ST_V_FAIL,
                     "no termino en 180 s");
    } else {
        stRxClear();
        psoc.stReport(ST_REP_CAL);
        stAwait(nTaps, 3000);
        int railed = 0, failed = 0;
        char det[96]; det[0] = '\0';
        for (uint8_t k = 0; k < nTaps; k++) {
            const PsocSelfTestResult *r = stFind((uint8_t)(ST_ID_CAL_BASE | k));
            if (!r) { failed++; continue; }
            if (r->status != ST_OK) { failed++; }
            /* Un codigo pegado a 0 o a 255 significa que el offset de esa
             * etapa no se pudo anular: hay algo mal en esa etapa. */
            if (r->v0 <= 0 || r->v0 >= 255) { railed++; }
            char one[20];
            snprintf(one, sizeof(one), "%s%ld", k ? "/" : "", (long)r->v0);
            strncat(det, one, sizeof(det) - strlen(det) - 1);
        }
        /* g_evCalOk es el veredicto que da el propio PSoC en CAL_DONE; antes
         * se guardaba y no se miraba. Una calibracion que el PSoC declara
         * fallida no puede dar PASS por mas que los codigos parezcan sanos. */
        calOk = (failed == 0) && (railed == 0) && (g_evCalOk != 0u);
        stReportItem("D8", "Auto-calibracion", calOk ? ST_V_PASS : ST_V_FAIL,
                     "IDAC %s, %d al riel, %d fallada(s), ok=%u, %lu s",
                     det, railed, failed, (unsigned)g_evCalOk,
                     (unsigned long)(calMs / 1000));
    }

    /* D5 necesita partir de un punto calibrado. Si D8 no cerro bien, ese punto
     * no existe y cualquier veredicto de D5 seria sobre datos de otra cosa. */
    if (!calOk) {
        stReportItem("D5", "Coherencia de rangos del ADC", ST_V_SKIP,
                     "la calibracion (D8) no cerro bien: falta el punto de partida");
        stRxClear();
        psoc.stReport(ST_REP_RESTORE);
        stAwait(1, 2000);
        return;
    }

    /* D5 — coherencia entre las 4 configs del ADC. Va DESPUES de D8 porque
     * necesita partir de un punto conocido y acotado: con la placa sin
     * calibrar el tap puede estar en cualquier lado, y cualquier cosa mas alla
     * de +-0,512 V recorta en la config 2, con lo que la "coherencia" mediria
     * basura o reprobaria una placa sana. */
    {
        int32_t uv[5]; int got = 0; bool clipped = false;
        uint8_t ch = (uint8_t)(nTaps - 1);
        uint8_t stage = (uint8_t)(nTaps - 1);

        /* D8 deja el tap EN EL NULO (target = 0 counts). Comparar cuatro
         * medidas de ~0 uV no valida nada: cualquier escalado, correcto o no,
         * da cero. Hace falta una excursion conocida. Se inyecta con el IDAC
         * de la ultima etapa y se mantiene por debajo de +-0,45 V para que la
         * config 2 (+-0,512 V) no recorte. */
        stRxClear();
        psoc.stReport(ST_REP_CAL);
        stAwait(nTaps, 2500);
        const PsocSelfTestResult *cal = stFind((uint8_t)(ST_ID_CAL_BASE | stage));
        uint8_t baseCode = cal ? (uint8_t)cal->v0 : 128;
        int offCode = (int)baseCode + 40;
        if (offCode > 255) { offCode = (int)baseCode - 40; }
        if (offCode < 0)   { offCode = 0; }
        bool offsetOk = stSetIdac(stage, (uint8_t)offCode);

        uint8_t cfgAplicadas = 0;
        for (uint8_t cfg = 1; cfg <= 4; cfg++) {
            if (!stSetAdcConfig(cfg)) { continue; }   /* sin ACK no se mide */
            cfgAplicadas++;
            stPump(300);
            int32_t m, pp;
            if (stMeasDc(ch, SEL_SETTLE_DC, m, pp)) {
                /* Si supera el fondo de escala de la config mas chica, la
                 * comparacion no significa nada. */
                if (labs((long)m) > 450000L) { clipped = true; }
                uv[got++] = m;
            }
        }
        (void)stSetAdcConfig(1);
        stPump(300);
        (void)stSetIdac(stage, baseCode);   /* siempre restaurar el calibrado */

        if (cfgAplicadas < 4u) {
            stReportItem("D5", "Coherencia de rangos del ADC", ST_V_FAIL,
                         "solo %u de 4 rangos confirmaron el ACK: no se puede "
                         "comparar lo que no se aplico", (unsigned)cfgAplicadas);
        } else if (!offsetOk) {
            stReportItem("D5", "Coherencia de rangos del ADC", ST_V_SKIP,
                         "no se pudo inyectar la excursion de prueba");
        } else if (clipped) {
            stReportItem("D5", "Coherencia de rangos del ADC", ST_V_SKIP,
                         "el tap quedo fuera de +-0.45 V: la config 2 recortaria");
        } else if (got == 4) {
            int32_t mn = uv[0], mx = uv[0];
            for (int i = 1; i < 4; i++) { if (uv[i] < mn) mn = uv[i]; if (uv[i] > mx) mx = uv[i]; }
            long amp = labs((long)mx) > labs((long)mn) ? labs((long)mx) : labs((long)mn);
            /* Si pese a la inyeccion la excursion quedo despreciable, el test
             * no puede concluir nada: decirlo, no dar un PASS decorativo. */
            if (amp < 20000L) {
                stReportItem("D5", "Coherencia de rangos del ADC", ST_V_SKIP,
                             "excursion de solo %ld uV: insuficiente para comparar rangos",
                             amp);
            } else {
                float spread = (float)(mx - mn) / (float)amp;
                stReportItem("D5", "Coherencia de rangos del ADC",
                             (spread <= TH_ADCCFG_SPREAD_MAX) ? ST_V_PASS : ST_V_FAIL,
                             "dispersion %.1f%% sobre %ld uV (%ld..%ld uV)",
                             (double)(spread * 100.0f), amp, (long)mn, (long)mx);
            }
        } else {
            stReportItem("D5", "Coherencia de rangos del ADC", ST_V_FAIL,
                         "solo %d de 4 configs midieron", got);
        }
    }

