simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main_selftest.cpp
    /* Devolver el AMux al canal de captura y parar el ADC: es el estado que el
     * resto del firmware del PSoC espera en IDLE. Sin esto queda seleccionado
     * el ultimo tap de prueba. */
    stRxClear();
    psoc.stReport(ST_REP_RESTORE);
    stAwait(1, 2000);
}

/* ==========================================================================
 * FASE INTERACTIVA — lo que ningun test automatico puede cubrir.
 * Se dispara por comando, nunca sola: pide acciones al operador.
 * ========================================================================== */

/* D7 — golpe al geofono. Captura 128 lotes (1,47 s a 2604 Hz) mientras el
 * operador golpea al lado del geofono, y decide con dos cosas:
 *
 *   - que el pico supere claramente el ruido de fondo (el geofono responde);
 *   - el SIGNO de la primera excursion grande, que es la POLARIDAD.
 *
 * La polaridad importa: entre campañas quedo documentada una inversion en
 * varias posiciones, y hasta ahora no habia forma de verificarla en el nodo.
 * El SM-24 tiene fn = 10 Hz y zeta = 0,25, asi que a 2604 Hz un ciclo del
 * timbrado son ~260 muestras y la captura cubre unos 14 ciclos. */
static void testTap()
{
    if (g_hw.geo == HW_AUSENTE) {
        stReportItem("D7", "Golpe al geofono", ST_V_SKIP,
                     "declarado ausente (hw geo 0): no tiene sentido pedir un golpe");
        return;
    }

    Serial.println(F(""));
    Serial.println(F("[ST] D7 — GOLPE AL GEOFONO"));
    Serial.println(F("[ST] Golpea el suelo al lado del geofono cuando diga YA."));

    /* El fondo se mide ANTES de la cuenta regresiva, con el suelo quieto.
     * Medirlo despues del YA metia el propio golpe en la referencia y subia
     * el umbral que ese mismo golpe tenia que superar. */
    Serial.println(F("[ST] Midiendo el ruido de fondo: no toques nada todavia..."));
    if (!stCapture(16, 0)) {
        stReportItem("D7", "Golpe al geofono", ST_V_FAIL, "no se pudo capturar el fondo");
        return;
    }
    int32_t floorPp = g_anMax - g_anMin;
    int32_t trig = (floorPp > 0) ? (floorPp * 2) : 100;

    for (int i = 3; i > 0; i--) { Serial.printf("[ST] %d...\n", i); stPump(1000); }
    Serial.println(F("[ST] YA!"));

    if (!stCapture(128, trig)) {
        stReportItem("D7", "Golpe al geofono", ST_V_FAIL, "no se pudo capturar");
        return;
    }
    int32_t peak = g_anPeakDev;
    bool hit = (peak > trig) && (peak > floorPp);
    const char *pol = (g_anFirstSign > 0) ? "POSITIVA"
                    : (g_anFirstSign < 0) ? "NEGATIVA" : "sin definir";
    stReportItem("D7", "Golpe al geofono (pico y polaridad)",
                 hit ? ST_V_PASS : ST_V_FAIL,
                 hit ? "pico %ld counts (fondo pp %ld), 1a excursion %s"
                     : "pico %ld counts no supera el fondo pp %ld: %s",
                 (long)peak, (long)floorPp, pol);
}

/* Pulsacion de los cuatro botones del ESP, de a uno. */
static void testButtonsEsp()
{
    if (g_hw.btn == HW_AUSENTE) {
        stReportItem("E1", "Botones del ESP", ST_V_SKIP,
                     "declarados ausentes (hw btn 0)");
        return;
    }
    const uint8_t pins[4] = { LOCAL_BTN_UP_PIN, LOCAL_BTN_DOWN_PIN,
                              LOCAL_BTN_OK_PIN, LOCAL_BTN_BACK_PIN };
    const char *names[4] = { "UP", "DOWN", "OK", "BACK" };
    for (int i = 0; i < 4; i++) {
        Serial.printf("[ST] Pulsa el boton %s (10 s)...\n", names[i]);
        uint32_t t0 = millis();
        bool seen = false;
        while ((millis() - t0) < 10000) {
            if (digitalRead(pins[i]) == LOW) { seen = true; break; }
            psoc.poll();   /* no dejar de drenar el ring durante 10 s */
            delay(5);
        }
        char code[8]; snprintf(code, sizeof(code), "E1.%d", i);
        char name[32]; snprintf(name, sizeof(name), "Boton %s del ESP", names[i]);
        stReportItem(code, name, seen ? ST_V_PASS : ST_V_FAIL,
                     seen ? "pulsacion detectada en GPIO%u" : "sin pulsacion en 10 s (GPIO%u)",
                     (unsigned)pins[i]);

        /* Esperar a que suelte, PERO ACOTADO. Un pin en corto a masa, o sin su
         * pull-up de 10 k, se queda en LOW para siempre: un `while` a secas
         * congelaba el autotest justo en el caso que hay que diagnosticar. */
        uint32_t tr = millis();
        while (digitalRead(pins[i]) == LOW && (millis() - tr) < 3000) { delay(5); }
        if (digitalRead(pins[i]) == LOW) {
            char c2[8]; snprintf(c2, sizeof(c2), "E1.%db", i);
            stReportItem(c2, "  ^ el pin quedo pegado en bajo", ST_V_FAIL,
                         "GPIO%u sigue en LOW 3 s despues: corto a masa o falta el pull-up",
                         (unsigned)pins[i]);
        }
        delay(200);
    }
}

/* Pulsacion del boton del PSoC (P2[2], el onboard del CY8CKIT-059). */
static void testButtonPsoc()
{
    if (g_hw.psoc == HW_AUSENTE) {
        stReportItem("E2", "Boton del PSoC (P2[2])", ST_V_SKIP,
                     "PSoC declarado ausente (hw psoc 0)");
        return;
    }

    Serial.println(F("[ST] Pulsa el boton del PSoC (10 s)..."));
    int idle = -1; bool changed = false;
    uint32_t t0 = millis();
    while ((millis() - t0) < 10000) {
        stRxClear();
        psoc.stReport(ST_REP_BUTTON);
        if (stAwait(1, 800) >= 1) {
            const PsocSelfTestResult *r = stFind(ST_ID_BUTTON);
            if (r) {
                if (idle < 0) { idle = (int)r->v0; }
                else if ((int)r->v0 != idle) { changed = true; break; }
            }
        }
        delay(30);
    }
    stReportItem("E2", "Boton del PSoC (P2[2])",
                 changed ? ST_V_PASS : ST_V_FAIL,
                 changed ? "cambio de nivel detectado" : "sin cambio en 10 s");
}

/* ==========================================================================
 * Cierre: integridad de trama sobre TODA la corrida.
 * ========================================================================== */
static void groupBClose()
{
    /* Ojo: `drop`/_syncDrops NO es criterio. Cuenta bytes de texto del PSoC
     * descartados por el framer mientras busca el marcador, y crece de forma
     * benigna incluso en reposo (hallazgo F8 del banco). Los unicos que
     * indican trama corrupta son bBad y badLen. */
    /* Si nunca llego un byte, "cero tramas corruptas" es cierto pero enganoso:
     * seria un PASS en una placa sin enlace. Corresponde SKIP. */
    if (psoc.bytesRx() == 0) {
        stReportItem("B4", "Integridad de trama en toda la corrida", ST_V_SKIP,
                     "no llego ningun byte del PSoC: nada que verificar");
        return;
    }
    bool ok = (psoc.batchesBad() == 0 && psoc.badLen() == 0);
    stReportItem("B4", "Integridad de trama en toda la corrida",
                 ok ? ST_V_PASS : ST_V_FAIL,
                 "bBad=%lu badLen=%lu (drop=%lu informativo)",
                 (unsigned long)psoc.batchesBad(), (unsigned long)psoc.badLen(),
                 (unsigned long)psoc.syncDrops());
}

