simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main_selftest.cpp
/* ==========================================================================
 * DIAGNOSTICO — de que item fallo a donde mirar en la placa.
 *
 * El checklist dice QUE fallo. Esto dice DONDE buscarlo, que es lo que hace
 * falta con el soldador en la mano. La tabla vive en flash y se recorre contra
 * los codigos que quedaron en FAIL o WARN.
 * ========================================================================== */
struct DiagHint {
    const char *code;      /* prefijo del codigo del item */
    const char *donde;     /* que revisar, en orden de probabilidad */
};

static const DiagHint DIAG_HINTS[] = {
    { "A1", "Alimentacion del ESP32. Un reset por BROWNOUT es regulador o "
            "condensador de desacople insuficiente." },
    { "A2", "OLED: CS=33 DC=16 RST=17 SCK=18 MOSI=23, y 3V3/GND del modulo. "
            "No es detectable por software: confirmar mirando la pantalla." },
    { "A3", "Pull-ups de 10 k a 3V3 en GPIO34/35/36/39. Esos pines son de solo "
            "entrada y NO tienen pull-up interno." },
    { "A4", "Radio del ESP32. Si A1 tambien fallo, mirar primero la alimentacion." },
    { "B1", "Enlace de subida: pull-ups de SDA(21)/SCL(22) a 3V3, GND comun, "
            "y que el PSoC este programado y alimentado." },
    { "B2", "Enlace de bajada: ESP GPIO26 -> PSoC Rx P15[0]. Si B1 pasa y B2 no, "
            "el problema esta en ESE cable, no en el I2C." },
    { "B3", "Linea de sincronismo: ESP GPIO27 -> PSoC SYNC_IN P0[4]." },
    { "B4", "Tramas corruptas: ruido en el bus I2C, pull-ups de valor muy alto, "
            "o cables largos. Ojo que `drop` NO cuenta como corrupcion." },
    { "C1", "El PSoC contesta pero no se identifica: firmware de PSoC viejo, "
            "sin los comandos de autotest." },
    { "C2", "Falla interna del PSoC: IRQ inesperada o HardFault. Anotar el "
            "numero de IRQ del detalle." },
    { "C4", "Camino digital de captura: superMaquina, DMA o el enlace. Si C4 "
            "falla no hay que creerle a ninguna medida analogica." },
    { "C5", "Filtro FIR: bloque DFB o su DMA. El resto de la captura funciona." },
    { "C6", "SD: CS=P1[6] SCK=P15[5] MOSI=P2[5] MISO=P15[4], mas alimentacion "
            "del zocalo. Son cuatro puertos distintos en la placa nueva." },
    { "C7", "Pulsador del PSoC en P2[2] (el de la placa CY8CKIT-059)." },
    { "D1", "Algun tap contra un riel. Mirar la fila D2 correspondiente para "
            "saber que etapa." },
    { "D2", "Etapa analogica sin respuesta: resistencia abierta, soldadura fria "
            "o amplificador operacional. El detalle dice que etapa." },
    { "D4", "Etapa PGAout o su red de realimentacion." },
    { "D5", "Referencia del ADC o el escalado de rangos." },
    { "D6", "Ruido: RMS casi nulo es ADC congelado; RMS enorme es una etapa "
            "oscilando. Mucho 50 Hz es masa o apantallamiento." },
    { "D7", "Geofono: bornera, continuidad de la bobina y polaridad del par." },
    { "D8", "Calibracion: un IDAC contra el riel significa que el offset de esa "
            "etapa no se puede anular. Mirar la resistencia de 30 k de esa "
            "referencia y su etapa." },
    { "E1", "Pulsadores del ESP y sus pull-ups." },
    { "E2", "Pulsador del PSoC." },
};

static void printDiagnostico()
{
    uint16_t nFail = stReportCount(ST_V_FAIL);
    uint16_t nWarn = stReportCount(ST_V_WARN);
    if (nFail == 0u && nWarn == 0u) { return; }

    Serial.println();
    Serial.println(F("DIAGNOSTICO — donde mirar:"));

    const size_t nHints = sizeof(DIAG_HINTS) / sizeof(DIAG_HINTS[0]);
    for (size_t i = 0; i < nHints; i++) {
        /* Se imprime la pista si hay algun item FAIL o WARN cuyo codigo empiece
         * con este prefijo. Asi D6.2 y D2.1 caen bajo D6 y D2. */
        if (!stReportHasIssueWithPrefix(DIAG_HINTS[i].code)) { continue; }
        Serial.printf("  [%s] %s\n", DIAG_HINTS[i].code, DIAG_HINTS[i].donde);
    }
    Serial.println(F("  (los WARN no reprueban la placa; los FAIL si)"));
}

/* ── Corrida completa ────────────────────────────────────────────────────── */
static void runAutotest()
{
    char espBuild[48], psocBuild[48], mac[20];
    snprintf(espBuild, sizeof(espBuild), "slaveTest %s %s", __DATE__, __TIME__);
    snprintf(psocBuild, sizeof(psocBuild), "AcondAnalogTest (ver DIAG BOOT)");
    uint8_t m[6];
    WiFi.macAddress(m);
    snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X",
             m[0], m[1], m[2], m[3], m[4], m[5]);

    stReportReset();
    stReportBegin(espBuild, psocBuild, mac, NODE_ID);
    Serial.printf("HW   oled=%s btn=%s geo=%s sd=%s psoc=%s   ('hw' para cambiarlo)\n",
                  hwName(g_hw.oled), hwName(g_hw.btn), hwName(g_hw.geo),
                  hwName(g_hw.sd), hwName(g_hw.psoc));

    Serial.println(F("--- grupo A: ESP32 solo ---"));
    groupA();
    Serial.println(F("--- grupo B: enlace con el PSoC ---"));
    if (groupB()) {
        Serial.println(F("--- grupo C: infraestructura del PSoC ---"));
        if (groupC()) {
            Serial.println(F("--- grupo D: cadena analogica (el mas largo, ~2 min) ---"));
            groupD();
        } else {
            Serial.println(F("[ST] El PSoC no habla el protocolo de autotest."));
            Serial.println(F("[ST] Graba el proyecto AcondicionamientoAnalogicoTest y volve a probar."));
            stReportItem("D*", "Tests analogicos", ST_V_SKIP,
                         "el PSoC no tiene el firmware de autotest");
        }
    } else {
        stReportItem("C*", "Tests del PSoC", ST_V_SKIP, "sin enlace con el PSoC");
        stReportItem("D*", "Tests analogicos", ST_V_SKIP, "sin enlace con el PSoC");
    }
    groupBClose();
    stReportSummary();
    printDiagnostico();

    localUiShowSelfTest(stReportCount(ST_V_PASS), stReportCount(ST_V_FAIL),
                        stReportCount(ST_V_WARN), stReportCount(ST_V_SKIP),
                        stReportFirstFail());
}

/* ── Consola USB ─────────────────────────────────────────────────────────── */
static void handleCmd(const char *cmd)
{
    if (!strcmp(cmd, "run") || !strcmp(cmd, "test")) {
        runAutotest();
    } else if (!strcmp(cmd, "a")) {
        stReportReset(); groupA(); stReportSummary();
    } else if (!strcmp(cmd, "b")) {
        stReportReset(); groupB(); groupBClose(); stReportSummary();
    } else if (!strcmp(cmd, "c")) {
        stReportReset(); (void)groupC(); stReportSummary();
    } else if (!strcmp(cmd, "d")) {
        stReportReset(); groupD(); stReportSummary();
    } else if (!strcmp(cmd, "tap") || !strcmp(cmd, "golpe")) {
        stReportReset(); testTap(); stReportSummary();
    } else if (!strcmp(cmd, "e") || !strcmp(cmd, "inter")) {
        stReportReset();
        testButtonsEsp();
        testButtonPsoc();
        testTap();
        stReportSummary();
    } else if (!strncmp(cmd, "hw", 2) && (cmd[2] == '\0' || cmd[2] == ' ')) {
        /* `hw` solo lista; `hw <parte> <0|1|2>` fija y guarda en NVS. */
        char parte[8] = {0};
        int val = -1;
        if (cmd[2] == '\0' || sscanf(cmd + 2, "%7s %d", parte, &val) < 2) {
            hwPrint();
        } else if (val < 0 || val > 2) {
            Serial.println(F("[ST] valor invalido: 0=ausente 1=presente 2=auto"));
        } else {
            uint8_t v = (uint8_t)val;
            bool ok = true;
            if      (!strcmp(parte, "oled")) { g_hw.oled = v; }
            else if (!strcmp(parte, "btn"))  { g_hw.btn  = v; }
            else if (!strcmp(parte, "geo"))  { g_hw.geo  = v; }
            else if (!strcmp(parte, "sd"))   { g_hw.sd   = v; }
            else if (!strcmp(parte, "psoc")) { g_hw.psoc = v; }
            else { ok = false; Serial.printf("[ST] parte desconocida '%s'\n", parte); }
            if (ok) { hwSave(); hwPrint(); }
        }
    } else if (!strcmp(cmd, "oled si") || !strcmp(cmd, "oled ok")) {
        g_hw.oled = HW_PRESENTE; hwSave();
        Serial.println(F("[ST] OLED marcado PRESENTE y funcionando (confirmado a ojo)."));
    } else if (!strcmp(cmd, "oled no")) {
        g_hw.oled = HW_AUSENTE; hwSave();
        Serial.println(F("[ST] OLED marcado AUSENTE: A2 va a dar SKIP de ahora en mas."));
    } else if (!strcmp(cmd, "probe")) {
        bool ok = psoc.probe(400);
        Serial.printf("[ST] probe=%d bOK=%lu bBad=%lu ping=%lu diag=%lu ovr=%lu\n",
                      (int)ok, (unsigned long)psoc.batchesOK(),
                      (unsigned long)psoc.batchesBad(), (unsigned long)psoc.pingsRx(),
                      (unsigned long)psoc.diagEventsRx(),
                      (unsigned long)psoc.i2cOverruns());
    } else if (!strcmp(cmd, "help") || !strcmp(cmd, "?")) {
        Serial.println(F("[ST] run|test  corrida completa"));
        Serial.println(F("[ST] a b c d   corre solo ese grupo"));
        Serial.println(F("[ST] tap       golpe al geofono: pico + POLARIDAD"));
        Serial.println(F("[ST] e|inter   fase interactiva (botones + golpe)"));
        Serial.println(F("[ST] probe     estado del enlace con el PSoC"));
        Serial.println(F("[ST] hw        ver el perfil de hardware presente"));
        Serial.println(F("[ST] hw X N    X=oled|btn|geo|sd|psoc  N=0 ausente 1 presente 2 auto"));
        Serial.println(F("[ST] oled si|no  confirmar a ojo si el OLED anda"));
    } else if (cmd[0] != '\0') {
        Serial.printf("[ST] comando desconocido '%s' (help)\n", cmd);
    }
}

static void serviceUsb()
{
    static char line[32];
    static uint8_t pos = 0;
    while (Serial.available() > 0) {
        char ch = (char)Serial.read();
        if (ch == '\r' || ch == '\n') {
            line[pos] = '\0';
            handleCmd(line);
            pos = 0;
        } else if (ch == 8 || ch == 127) {
            if (pos > 0) { pos--; }
        } else if (ch >= 32 && ch <= 126) {
            if (pos < sizeof(line) - 1) { line[pos++] = ch; }
        }
    }
}

/* Mide el bus I2C como GPIO, ANTES de inicializar Wire.
 *
 * TIENE que correr antes de psoc.begin(). TwoWire::begin() arranca con
 *   if (is_slave) { log_w("Bus already started in Slave Mode."); goto end; }
 * o sea que si el bus ya esta levantado, una segunda llamada NO reasigna los
 * pines. Hacer esta medicion despues le roba los pines al periferico y no hay
 * forma de devolverselos: el enlace queda muerto por culpa del propio test.
 * (Pasó: dos corridas dieron "silencio total" por esto y no por la placa.)
 *
 * Dos cosas se miden y responden preguntas distintas:
 *   - Nivel de reposo: un bus sano tiene SDA y SCL en ALTO por sus pull-ups.
 *     Se lee con INPUT pelado; con INPUT_PULLUP el pull-up interno del ESP
 *     (~45 k) taparia justo la falla que se busca.
 *   - Flancos en SCL: en I2C el reloj lo genera SIEMPRE el maestro, que aca es
 *     el PSoC. Si hay flancos, el PSoC esta transmitiendo y el problema es del
 *     lado del ESP; si no hay, el PSoC no habla. */
static void medirBusI2C()
{
    pinMode(PSOC_I2C_SDA, INPUT);
    pinMode(PSOC_I2C_SCL, INPUT);
    delayMicroseconds(200);

    g_busSdaN = 0;
    g_busSclN = 0;
    for (int k = 0; k < 50; k++) {
        if (digitalRead(PSOC_I2C_SDA) == HIGH) { g_busSdaN++; }
        if (digitalRead(PSOC_I2C_SCL) == HIGH) { g_busSclN++; }
        delay(1);
    }
    g_busSdaAlta = (g_busSdaN >= 45) ? 1 : 0;
    g_busSclAlta = (g_busSclN >= 45) ? 1 : 0;

