simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main_selftest.cpp
    /* Segunda pasada con el pull-up INTERNO del ESP (~45 k). Distingue dos
     * causas que "la linea esta en bajo" confunde:
     *   - sube con el pull-up interno -> nadie la esta forzando; lo que falta
     *     es el pull-up EXTERNO de la placa.
     *   - sigue en bajo -> algo la esta reteniendo: corto a masa, o un
     *     dispositivo de colector abierto colgado (por ejemplo un maestro I2C
     *     trabado a mitad de transferencia).
     * Es seguro: un pull-up de 45 k no pelea con nada. */
    pinMode(PSOC_I2C_SDA, INPUT_PULLUP);
    pinMode(PSOC_I2C_SCL, INPUT_PULLUP);
    delay(5);
    g_busSdaPu = 0;
    g_busSclPu = 0;
    for (int k = 0; k < 30; k++) {
        if (digitalRead(PSOC_I2C_SDA) == HIGH) { g_busSdaPu++; }
        if (digitalRead(PSOC_I2C_SCL) == HIGH) { g_busSclPu++; }
        delay(1);
    }
    /* Tercera pasada, con el pull-DOWN interno (~45 k). Esta si MIDE si hay un
     * pull-up externo fuerte, en vez de inferirlo:
     *
     *   - Con un pull-up externo de 10 k a 3V3, el divisor contra los 45 k
     *     internos da 3,3 * 45/(45+10) = 2,7 V -> se lee ALTO.
     *   - Sin pull-up externo, el pull-down se impone -> se lee BAJO.
     *
     * SDA sirve de control: ahi el pull-up externo esta confirmado, asi que si
     * SDA lee alto y SCL lee bajo con el mismo pull-down, la diferencia es
     * real y esta en el cobre, no en el metodo. */
    pinMode(PSOC_I2C_SDA, INPUT_PULLDOWN);
    pinMode(PSOC_I2C_SCL, INPUT_PULLDOWN);
    delay(5);
    g_busSdaPd = 0;
    g_busSclPd = 0;
    for (int k = 0; k < 30; k++) {
        if (digitalRead(PSOC_I2C_SDA) == HIGH) { g_busSdaPd++; }
        if (digitalRead(PSOC_I2C_SCL) == HIGH) { g_busSclPd++; }
        delay(1);
    }

    pinMode(PSOC_I2C_SDA, INPUT);
    pinMode(PSOC_I2C_SCL, INPUT);

    /* El PSoC pinguea cada ~700 ms mientras espera al ESP: 3 s cubren varios. */
    g_sclEdges = 0;
    attachInterrupt(digitalPinToInterrupt(PSOC_I2C_SCL), onSclEdge, CHANGE);
    delay(3000);
    detachInterrupt(digitalPinToInterrupt(PSOC_I2C_SCL));
    g_busSclFlancos = g_sclEdges;
}

/* ── setup / loop ────────────────────────────────────────────────────────── */
void setup()
{
    Serial.begin(115200);
    delay(300);

    /* El perfil de hardware declarado tiene que estar cargado antes del primer
     * test: define si una parte que no contesta es SKIP, WARN o FAIL. */
    hwLoad();

    pinMode(SYNC_TO_PSOC_PIN, OUTPUT);
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);

    localUiBegin();

    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);
    esp_wifi_set_ps(WIFI_PS_NONE);
    WiFi.disconnect();
    delay(100);

    transport.begin(g_masterMac);

    /* ANTES de psoc.begin(): despues, Wire ya tiene los pines y medirlos como
     * GPIO rompe el enlace sin posibilidad de devolverlos. */
    medirBusI2C();

    psoc.onDiag(onDiag);
    psoc.onSelfTest(onSelfTest);
    psoc.begin(onBatch);

    /* El PSoC tarda en arrancar y este firmware lo primero que hace es
     * medir: darle tiempo evita reportar un falso "sin enlace". */
    stPump(2000);
    (void)psoc.probe(600);

    runAutotest();

    Serial.println(F("[ST] Fase automatica terminada."));
    Serial.println(F("[ST] Falta la fase INTERACTIVA, que ningun test automatico"));
    Serial.println(F("[ST] puede cubrir: escribi 'e' para botones + golpe al"));
    Serial.println(F("[ST] geofono (da la POLARIDAD), o 'tap' para solo el golpe."));
    Serial.println(F("[ST] 'run' repite lo automatico, 'help' lista todo."));
}

void loop()
{
    psoc.poll();
    serviceUsb();

    /* Re-sondeo periodico mientras no haya trafico del PSoC, igual que hace el
     * firmware de campo. El PSoC espera un PONG o un STATUS para salir de
     * wait_for_esp(); si se reinicia (ToggleReset) despues del sondeo inicial,
     * sin esto queda mudo hasta que alguien corra el autotest de nuevo. */
    static uint32_t ultimoSondeo = 0;
    if (psoc.bytesRx() == 0u && (millis() - ultimoSondeo) > 2000u) {
        ultimoSondeo = millis();
        psoc.sendPong();
        psoc.requestStatus();
    }

    delay(1);
}
